posts/python-cookbook-readnote-5/index.org
#+BEGIN_COMMENT
.. title: Python Cookbook 读书笔记（五）
.. slug: python-cookbook-readnote-5
.. date: 2017-07-30
.. tags: python
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT


* chapter 8: Classes and Objects
** 8.1. Changing the String Representation of Instances
   It's good practice to define both __repr__() and __str__()

*** the __repr__() method of a class: the literal representation of a object
    eval(repr(x)) = x
    It it not possiable to create an object from the repr(x) results, then the repr(x) result should be enclosed in '<>' 

*** the __str__() method of a class: the toString method  of a object
    The method will be called  when the object is passed to print() function
    If __str__() is not provided, then __repr__() will be used.

*** the format function: positional field, by {N}, N means the nth parameter
    ValueError: cannot switch from manual field specification to automatic field numbering
    If you put a numbers to a field, then you should put numbers to all field.
    #+begin_src python :results output
    a = '{0}, {1},  {1}'.format(1, 2)
    print(a)
    #+end_src

    #+RESULTS:
    : 1, 2,  2

    Get an object's attribute by {N.attt_name} syntax
    #+begin_src python :results output
    import itertools
    a = '{0}, {0.chain}, {0.permutations}'.format(itertools)
    print(a)
    #+end_src

    #+RESULTS:
    : <module 'itertools' (built-in)>, <class 'itertools.chain'>, <class 'itertools.permutations'>

    for {0!r} or {0!s}, '!r' means use __repr__(), '!s' means use __str__(). '!s' is the default value.
    
** 8.2. Customizing String Formatting 

*** the format(aobj[, format_spec]) builtin function 
    The function is equal to: aobj.__format__(format_spec)
    而一般的aobj.__format__(spec) 的实现是调用 str.format(...) 函数来实现。

    str.format(...) method 还支持关键字参数来指定field name.(问题：当关键字参数与普通参数混合时会发生什么？)
    {:spec} 中的 spec 会传给 aobj.__format__(format_spec) 作为参数。 spec 可以为任意字符串，它可以作为参数传递给aobj.__format__() method.

    str.format(aobj)时， 到底是哪个method会被调用呢？
    From below codes, it can be see that if __format__ method is defined, then __format__ will be called. else __str__ will be called, when the object is formated by the str.format(...) method.
    For str(aobj), aobj.__str__ will always be called.
    #+begin_src python :results output
    class Point:
        def __init__(self, x, y):
            self.x = x
            self.y = y

        def __repr__(self):
            print("__repr__ called")
            return 'Point({0.x}, {0.y})'.format(self)

        def __str__(self):
            print("__str__ called")
            return '({0.x}, {0.y})'.format(self)

        def __format__(self, spec):
            print("__format__ called. spec: %s." % spec)
            return '({0.x}, {0.y})'.format(self)

    p = Point(2, 3)
    a = '{}'.format(p)
    print(a)
    print(p)


    #+end_src

    #+RESULTS:
    : __format__ called. spec: .
    : (2, 3)
    : __str__ called
    : (2, 3)

** [NOT FINISHED]8.3. Making Objects Support the Context-Management Protocol, that is, the with statement
   To provide with statement support, just define two methods:
   1. __enter__(self)
   2. __exit__(self, exc_ty, exc_val, tb)
   
   #+begin_src python :results output
   class SaveVar:
       def __init__(self, avar):
           self.avar = avar
       def __enter__(self):
           print("__enter__ called")
   #+end_src

** 8.5. Encapsulating Names in a Class
*** one underscore _ means private variable, just convention, you can still access that  variable outside  of a class
    #+begin_src python :results output
    class Person:
        def __init__(self, name, age):
            self._name = name
            self._age = age
        def __str__(self):
            return '(name: {}, age: {})'.format(self._name, self._age)

    p = Person('Jim', 23)
    print(p)
    print(p._name, p._age)
    #+end_src

    #+RESULTS:
    : (name: Jim, age: 23)
    : Jim 23

