posts/python-cookbook-readnote-5/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Python Cookbook 读书笔记（五） | Astropeak</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
            <h1 class="site-title">
                <a href="https://astropeak.github.io/" title="Astropeak" rel="home">Astropeak</a>
            </h1>
        </div>
        <nav class="site-navigation" role="navigation"><div class="menu-toggle">
                <span class="mobile-site-title">Astropeak</span>
            </div>
            <ul class="menu">
<li><a href="../../archive.html">Archive</a></li>
                    <li><a href="../../categories/">Tags</a></li>
                    <li><a href="../../rss.xml">RSS feed</a></li>
                    <li><a href="http://github.com/astropeak">Github</a></li>
            </ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
        <div class="entry-meta">
            <span class="posted-on">
                Posted on <a href="." rel="bookmark">July 30, 2017</a>
            </span>
        </div>
        <h1>Python Cookbook 读书笔记（五）</h1>
    </div>

        <!-- Page Content -->
    <div class="site-content" role="main">
        <article class="format-standard libretto-long-form"><div class="entry-content">
                <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">chapter 8: Classes and Objects</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">8.1. Changing the String Representation of Instances</h3>
<div class="outline-text-3" id="text-1-1">
<p>
It's good practice to define both _<sub>repr</sub>_<sub>()</sub> and _<sub>str</sub>_<sub>()</sub></p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">the _<sub>repr</sub>_<sub>()</sub> method of a class: the literal representation of a object</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
eval(repr(x)) = x
It it not possiable to create an object from the repr(x) results, then the repr(x) result should be enclosed in '&lt;&gt;' 
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">the _<sub>str</sub>_<sub>()</sub> method of a class: the toString method  of a object</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
The method will be called  when the object is passed to print() function
If _<sub>str</sub>_<sub>()</sub> is not provided, then _<sub>repr</sub>_<sub>()</sub> will be used.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">the format function: positional field, by {N}, N means the nth parameter</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
ValueError: cannot switch from manual field specification to automatic field numbering
If you put a numbers to a field, then you should put numbers to all field.
</p>
<div class="highlight"><pre><span></span><span class="n">a</span> <span class="o">=</span> <span class="s1">'{0}, {1},  {1}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
</pre></div>

<p>
Get an object's attribute by {N.attt<sub>name</sub>} syntax
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">itertools</span>
<span class="n">a</span> <span class="o">=</span> <span class="s1">'{0}, {0.chain}, {0.permutations}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">itertools</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
</pre></div>

<p>
for {0!r} or {0!s}, '!r' means use _<sub>repr</sub>_<sub>()</sub>, '!s' means use _<sub>str</sub>_<sub>()</sub>. '!s' is the default value.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">8.2. Customizing String Formatting</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">the format(aobj[, format<sub>spec]</sub>) builtin function</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
The function is equal to: aobj._<sub>format</sub>_<sub>(format<sub>spec</sub>)</sub>
而一般的aobj._<sub>format</sub>_<sub>(spec)</sub> 的实现是调用 str.format(…) 函数来实现。
</p>

<p>
str.format(…) method 还支持关键字参数来指定field name.(问题：当关键字参数与普通参数混合时会发生什么？)
{:spec} 中的 spec 会传给 aobj._<sub>format</sub>_<sub>(format<sub>spec</sub>)</sub> 作为参数。 spec 可以为任意字符串，它可以作为参数传递给aobj._<sub>format</sub>_<sub>()</sub> method.
</p>

<p>
str.format(aobj)时， 到底是哪个method会被调用呢？
From below codes, it can be see that if <span class="underline"><span class="underline">format</span></span> method is defined, then <span class="underline"><span class="underline">format</span></span> will be called. else <span class="underline"><span class="underline">str</span></span> will be called, when the object is formated by the str.format(…) method.
For str(aobj), aobj._<sub>str</sub>__ will always be called.
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Point</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">x</span><span class="p">,</span> <span class="n">y</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">x</span> <span class="o">=</span> <span class="n">x</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">y</span> <span class="o">=</span> <span class="n">y</span>

    <span class="k">def</span> <span class="fm">__repr__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"__repr__ called"</span><span class="p">)</span>
	<span class="k">return</span> <span class="s1">'Point({0.x}, {0.y})'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="p">)</span>

    <span class="k">def</span> <span class="fm">__str__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"__str__ called"</span><span class="p">)</span>
	<span class="k">return</span> <span class="s1">'({0.x}, {0.y})'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">__format__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">spec</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"__format__ called. spec: </span><span class="si">%s</span><span class="s2">."</span> <span class="o">%</span> <span class="n">spec</span><span class="p">)</span>
	<span class="k">return</span> <span class="s1">'({0.x}, {0.y})'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="p">)</span>

<span class="n">p</span> <span class="o">=</span> <span class="n">Point</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">)</span>
<span class="n">a</span> <span class="o">=</span> <span class="s1">'{}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">p</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="p">)</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">[NOT FINISHED]8.3. Making Objects Support the Context-Management Protocol, that is, the with statement</h3>
<div class="outline-text-3" id="text-1-3">
<p>
To provide with statement support, just define two methods:
</p>
<ol class="org-ol">
<li>_<sub>enter</sub>_<sub>(self)</sub>
</li>
<li>_<sub>exit</sub>_<sub>(self, exc<sub>ty</sub>, exc<sub>val</sub>, tb)</sub>
</li>
</ol>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">SaveVar</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">avar</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">avar</span> <span class="o">=</span> <span class="n">avar</span>
    <span class="k">def</span> <span class="fm">__enter__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"__enter__ called"</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">8.5. Encapsulating Names in a Class</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">one underscore _ means private variable, just convention, you can still access that  variable outside  of a class</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Person</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">name</span><span class="p">,</span> <span class="n">age</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">_name</span> <span class="o">=</span> <span class="n">name</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">_age</span> <span class="o">=</span> <span class="n">age</span>
    <span class="k">def</span> <span class="fm">__str__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">return</span> <span class="s1">'(name: {}, age: {})'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">_name</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">_age</span><span class="p">)</span>

<span class="n">p</span> <span class="o">=</span> <span class="n">Person</span><span class="p">(</span><span class="s1">'Jim'</span><span class="p">,</span> <span class="mi">23</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="o">.</span><span class="n">_name</span><span class="p">,</span> <span class="n">p</span><span class="o">.</span><span class="n">_age</span><span class="p">)</span>
</pre></div>
</div>
</div>
