posts/python-cookbook-readnote-5/index.org
*** two underscore __ means name mangling, when used for inheritance
    the variable will be renamed to _C__name. Then it will not override the super class's variable.
    Because it is also has one leading underscore, so the rules for one underscore also applies.

    __age is renamed to _Person__age:
    #+begin_src python :results output
    class Person:
        def __init__(self, name, age):
            self._name = name
            self.__age = age
        def __str__(self):
            return '(name: {}, age: {})'.format(self._name, self.__age)

    p = Person('Jim', 23)
    print(p)
    print(dir(p))
    print(p._name, p._Person__age)
    #+end_src

    #+RESULTS:
    : (name: Jim, age: 23)
    : ['_Person__age', '__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_name']
    : Jim 23

** 8.6. Creating Managed Attributes, with @property decorator/annotation, add a setter, getter, deleter to a field
   Steps:
   1. first create a property object by @property decorator, on a getter method. The name of the getter should be the same with the attribute field.
   2. create the setter object: by @attribute_name.setter, on a setter method. The name of the setter should be the same with the attribute field.
   3. the getter, setter function are a way to define what will be called when the attribute with the same name is get,  set. 
      e.g. the attribute name is 'foo', then the 'foo' attribute will be a object that has methods: 'getter', 'setter', 'deleter'. You can choose any name to store the real value for this  attribute, but the most common value will be add a underscore, that is '_foo'.
      Type of 'foo' is <class 'property'>
   
    #+begin_src python :results output
    class Person:
        def __init__(self, name, age):
            # here the name attribute is depend on the def name(self) getter function. Not the reverse.
            self.name = name
            self.age = age
        def __str__(self):
            return '(name: {}, age: {})'.format(self.name, self.age)

        @property
        def name(self):
            print("getting name")
            return self.nameL

        @name.setter
        def name(self, name):
            print("setting name")
            if not isinstance(name, str):
                raise TypeError

            self.nameL = name

    p = Person('Jim', 23)
    p.name = "Tom"
    print(p)
    print(dir(p))
    print(type(Person.name), dir(Person.name))
    #+end_src

    #+RESULTS:
    : setting name
    : setting name
    : getting name
    : (name: Tom, age: 23)
    : ['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', 'age', 'name', 'nameL']
    : <class 'property'> ['__class__', '__delattr__', '__delete__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__get__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__isabstractmethod__', '__le__', '__lt__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__set__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'deleter', 'fdel', 'fget', 'fset', 'getter', 'setter']

** create caculate attribute by @property, getter, setter, then the attribute works like a attribute,  not a method
   Seems a good application of @property.

    #+begin_src python :results output
    class Circle:
        def __init__(self, radis):
            self.radis = radis

        @property
        def area(self):
            print("getting area")
            return self.radis*self.radis*3.14

    p = Circle(4)
    print(p.radis)
    print(p.area)
    #+end_src

    #+RESULTS:
    : 4
    : getting area
    : 50.24

** 8.7. Calling a Method on a Parent Class, by super() function
   There are many format
   #+begin_src python :results output
   super() # unbound
   super(type, obj) # isinstance(obj, type)
   super(type, type2) # issubclass(type2, type). issubclass(object, object) is True
   #+end_src
