posts/python-cookbook-readnote-5/index.html

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">two underscore __ means name mangling, when used for inheritance</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
the variable will be renamed to _C_<sub>name</sub>. Then it will not override the super class's variable.
Because it is also has one leading underscore, so the rules for one underscore also applies.
</p>

<p>
_<sub>age</sub> is renamed to _Person_<sub>age</sub>:
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Person</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">name</span><span class="p">,</span> <span class="n">age</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">_name</span> <span class="o">=</span> <span class="n">name</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">__age</span> <span class="o">=</span> <span class="n">age</span>
    <span class="k">def</span> <span class="fm">__str__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">return</span> <span class="s1">'(name: {}, age: {})'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">_name</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">__age</span><span class="p">)</span>

<span class="n">p</span> <span class="o">=</span> <span class="n">Person</span><span class="p">(</span><span class="s1">'Jim'</span><span class="p">,</span> <span class="mi">23</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="nb">dir</span><span class="p">(</span><span class="n">p</span><span class="p">))</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="o">.</span><span class="n">_name</span><span class="p">,</span> <span class="n">p</span><span class="o">.</span><span class="n">_Person__age</span><span class="p">)</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">8.6. Creating Managed Attributes, with @property decorator/annotation, add a setter, getter, deleter to a field</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Steps:
</p>
<ol class="org-ol">
<li>first create a property object by @property decorator, on a getter method. The name of the getter should be the same with the attribute field.
</li>
<li>create the setter object: by @attribute<sub>name</sub>.setter, on a setter method. The name of the setter should be the same with the attribute field.
</li>
<li>the getter, setter function are a way to define what will be called when the attribute with the same name is get,  set. 
e.g. the attribute name is 'foo', then the 'foo' attribute will be a object that has methods: 'getter', 'setter', 'deleter'. You can choose any name to store the real value for this  attribute, but the most common value will be add a underscore, that is '<sub>foo'</sub>.
Type of 'foo' is &lt;class 'property'&gt;

<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Person</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">name</span><span class="p">,</span> <span class="n">age</span><span class="p">):</span>
	<span class="c1"># here the name attribute is depend on the def name(self) getter function. Not the reverse.</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">name</span> <span class="o">=</span> <span class="n">name</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">age</span> <span class="o">=</span> <span class="n">age</span>
    <span class="k">def</span> <span class="fm">__str__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">return</span> <span class="s1">'(name: {}, age: {})'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">age</span><span class="p">)</span>

    <span class="nd">@property</span>
    <span class="k">def</span> <span class="nf">name</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"getting name"</span><span class="p">)</span>
	<span class="k">return</span> <span class="bp">self</span><span class="o">.</span><span class="n">nameL</span>

    <span class="nd">@name.setter</span>
    <span class="k">def</span> <span class="nf">name</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">name</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"setting name"</span><span class="p">)</span>
	<span class="k">if</span> <span class="ow">not</span> <span class="nb">isinstance</span><span class="p">(</span><span class="n">name</span><span class="p">,</span> <span class="nb">str</span><span class="p">):</span>
	    <span class="k">raise</span> <span class="ne">TypeError</span>

	<span class="bp">self</span><span class="o">.</span><span class="n">nameL</span> <span class="o">=</span> <span class="n">name</span>

<span class="n">p</span> <span class="o">=</span> <span class="n">Person</span><span class="p">(</span><span class="s1">'Jim'</span><span class="p">,</span> <span class="mi">23</span><span class="p">)</span>
<span class="n">p</span><span class="o">.</span><span class="n">name</span> <span class="o">=</span> <span class="s2">"Tom"</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="nb">dir</span><span class="p">(</span><span class="n">p</span><span class="p">))</span>
<span class="k">print</span><span class="p">(</span><span class="nb">type</span><span class="p">(</span><span class="n">Person</span><span class="o">.</span><span class="n">name</span><span class="p">),</span> <span class="nb">dir</span><span class="p">(</span><span class="n">Person</span><span class="o">.</span><span class="n">name</span><span class="p">))</span>
</pre></div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">create caculate attribute by @property, getter, setter, then the attribute works like a attribute,  not a method</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Seems a good application of @property.
</p>

<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Circle</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">radis</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">radis</span> <span class="o">=</span> <span class="n">radis</span>

    <span class="nd">@property</span>
    <span class="k">def</span> <span class="nf">area</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"getting area"</span><span class="p">)</span>
	<span class="k">return</span> <span class="bp">self</span><span class="o">.</span><span class="n">radis</span><span class="o">*</span><span class="bp">self</span><span class="o">.</span><span class="n">radis</span><span class="o">*</span><span class="mf">3.14</span>

<span class="n">p</span> <span class="o">=</span> <span class="n">Circle</span><span class="p">(</span><span class="mi">4</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="o">.</span><span class="n">radis</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="o">.</span><span class="n">area</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">8.7. Calling a Method on a Parent Class, by super() function</h3>
<div class="outline-text-3" id="text-1-7">
<p>
There are many format
</p>
<div class="highlight"><pre><span></span><span class="nb">super</span><span class="p">()</span> <span class="c1"># unbound</span>
<span class="nb">super</span><span class="p">(</span><span class="nb">type</span><span class="p">,</span> <span class="n">obj</span><span class="p">)</span> <span class="c1"># isinstance(obj, type)</span>
<span class="nb">super</span><span class="p">(</span><span class="nb">type</span><span class="p">,</span> <span class="n">type2</span><span class="p">)</span> <span class="c1"># issubclass(type2, type). issubclass(object, object) is True</span>
</pre></div>
</div>
</div>
