posts/python-cookbook-readnote-5/index.org
** 8.9. Creating a New Kind of Class or Instance Attribute, by creating a descriptor class for the type
   如果一个类定义了三个函数： __get__, __set__, __delete__, 则它是一个descriptor, 可能通过它来为一个instance的attribute添加一些get, set时的函数。

   @property 只是descriptor的一种表象， descriptor是最底层，最灵活的实现，在库中大量使用。 TODO： 可以再研究下基于descriptor， @property的实现。

   调用顺序：如果descriptor对应的class attribute 存在, 则总会优先调用这个descriptor的函数，来获取或设置attribute的值。
   但当descriptor只定义了__get__方法时，则如果同名的变量在instance.__dict__中存在，则会优先从instance.__dict__中获取。
   
   #+begin_src python :results output
   class Integer:
       def __init__(self, name):
           self.name = name

       def __get__(self, instance, cls):
           print("__get__ method called, name: %s" % self.name)
           # If instance is None, then it is the class attribute
           if instance:
               return instance.__dict__[self.name]
           else:
               return instance

       def __set__(self, instance, value):
           print("__set__ method called, name %s, value: %s" % (self.name, value))
           instance.__dict__[self.name] = value

   class Point:
       # 关键的是量的值，输入参数的值只是用于内部实现的。并且Integer的实现中使用instance.__dict__保存数据也只是一种实现方式。
       # Point.x决定了atribute的名称为x
       x = Integer('z')
       def __init__(self, x, y):
           self.x = x
           self.y = y

       def __str__(self):
           return '({0.x}, {0.y})'.format(self)


   p = Point(3, 2)
   print("p.x")
   print(p.x)
   print(p.__dict__)
   # setattr(p, 'x', 5)
   p.__dict__['x'] = 5
   print(p.x)
   print(p.__dict__)
   #+end_src

   #+RESULTS:
   : __set__ method called, name z, value: 3
   : p.x
   : __get__ method called, name: z
   : 3
   : {'z': 3, 'y': 2}
   : __get__ method called, name: z
   : 3
   : {'z': 3, 'y': 2, 'x': 5}

** 8.10. Using Lazily Computed Properties, an application of descriptor
** 8.11. Simplifying the Initialization of Data Structures, by define a common base class
   #+begin_src python :results output
   # python  is very flexiable
   class Structure:
       _fields = []
       def __init__(self, *args):
           if len(self._fields) != len(args):
               raise TypeError('Expected {} arguments'.format(len(self._fields)))
           for k, v in zip(self._fields, args):
               setattr(self, k, v)
       def __str__(self):
           return '({})'.format(', '.join('{}: {}'.format(f, getattr(self, f)) for f in self._fields))

   class Point(Structure):
       _fields = ['x', 'y']
       # def __str__(self):
       #     return '(x: {0.x}, y: {0.y})'.format(self)

   class Circle(Structure):
       _fields = ['radius']
       # def __str__(self):
       #     return '(radius: {0.radius})'.format(self)

   p = Point(1, 2)
   print(p)
   p = Circle(3)
   print(p)
   #+end_src

   #+RESULTS:
   : (x: 1, y: 2)
   : (radius: 3)

