posts/python-cookbook-readnote-5/index.org
** class attributes can also be accessed by instance object, such as self, but only when the same instance attribute not exists
   #+begin_src python :results output
   class Foo:
       class_attr = "ABC"
       def __init__(self, a):
           self.a = a

   f = Foo('BB')
   print(f.class_attr, f.a)
   print(f.class_attr is Foo.class_attr)

   class Bar:
       class_attr = "ABC"
       def __init__(self, a):
           self.class_attr = a
           self.a = a

   b = Bar('BB')
   print(b.class_attr, b.a)
   print(b.class_attr is Bar.class_attr)
   #+end_src

   #+RESULTS:
   : ABC BB
   : True
   : BB BB
   : False

** 8.12. Defining an Interface or Abstract Base Class
*** create an abstract base class, or interface, by abc.ABCMeta, abc.abstractmethod
    A abstract class can't be initialized.
    #+begin_src python :results output
    from abc import ABCMeta, abstractmethod
    class IStream(metaclass=ABCMeta):
        @abstractmethod
        def read(self, maxbytes=-1):
            pass
        @abstractmethod
        def write(self, data):
            pass

    # typical usage:
    def  foo(obj):
        if isinstance(obj, IStream):
            # processing an IStream here
            pass

    a = IStream()
    #+end_src

    #+RESULTS:

*** register another class to a 'sub class ' of a abstract base class, by abc.register(cls) function
    Then isinstance(obj, AbstractBaseClass) will be  True. This let another class which is not a subclass of a base class, but can still pass the isinstance() test, which means implementing a interface.

    #+begin_src python :results output
    import io
    # Register the built-in I/O classes as supporting our interface
    IStream.register(io.IOBase)
    # Open a normal file and type check
    f = open('foo.txt')
    isinstance(f, IStream) # Returns True
    #+end_src

    #+RESULTS:

** 8.13. Implementing a Data Model or Type System, by descriptor
   感觉根之前小节讲到的descriptor相同，只不过用了继承的方式写了很多细小的descriptor。
** what is a descriptor? and its usage
   A descriptor is  a class attribute object, which has __get__, __set__, or __delete__ method, is used to define how a instance attribute is get, set, and delete. When an  instance attribute is get, the descriptor's __get__ method will be called. The same thing applys to __set__ and __delete__

   In descriptor's __get__, __set__ methods, we must use instance.__dict__[xxx] to get a attribute. If we use getattr(instance, xxx) to get that attribute, then there will be a recursion error as below, because the getattr() function will trigger a new call of __get__ method.
   RecursionError: maximum recursion depth exceeded while calling a Python object

   The relationship between the descriptor object and an instance attribute:
   1. if the descriptor object is assigned to a class attribute with name 'attribute_a', then it will control the instance attribute with the same name.
   2. but there is  one exception: if only the __get__ method of a descriptor is defined, then the instance attribute with the same name will be not be controled by the  descriptor, it will be get directly from the __dict__.
   
   a test:
   #+begin_src python :results output
   class TraceDescriptor:
       def __init__(self, name):
           self.name = name

       def __get__(self, instance, cls):
           if instance:
               print('Getting attribute {}, value is {}'.format(self.name, instance.__dict__[self.name]))
               return instance.__dict__[self.name]
               # return getattr(instance, self.name)
           else:
               return instance


       def __set__(self, instance, value):
           print('Setting attribute {} to {}'.format(self.name, value))
           instance.__dict__[self.name] = value

   class Circle:
       radius = TraceDescriptor('radius')
       def __init__(self,  radius):
           self.radius = radius

   c =  Circle(4)

   print(c.radius)
   #+end_src

   #+RESULTS:

