posts/python-cookbook-readnote-5/index.html

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">class attributes can also be accessed by instance object, such as self, but only when the same instance attribute not exists</h3>
<div class="outline-text-3" id="text-1-11">
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Foo</span><span class="p">:</span>
    <span class="n">class_attr</span> <span class="o">=</span> <span class="s2">"ABC"</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">a</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">a</span> <span class="o">=</span> <span class="n">a</span>

<span class="n">f</span> <span class="o">=</span> <span class="n">Foo</span><span class="p">(</span><span class="s1">'BB'</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="o">.</span><span class="n">class_attr</span><span class="p">,</span> <span class="n">f</span><span class="o">.</span><span class="n">a</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="o">.</span><span class="n">class_attr</span> <span class="ow">is</span> <span class="n">Foo</span><span class="o">.</span><span class="n">class_attr</span><span class="p">)</span>

<span class="k">class</span> <span class="nc">Bar</span><span class="p">:</span>
    <span class="n">class_attr</span> <span class="o">=</span> <span class="s2">"ABC"</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">a</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">class_attr</span> <span class="o">=</span> <span class="n">a</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">a</span> <span class="o">=</span> <span class="n">a</span>

<span class="n">b</span> <span class="o">=</span> <span class="n">Bar</span><span class="p">(</span><span class="s1">'BB'</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">b</span><span class="o">.</span><span class="n">class_attr</span><span class="p">,</span> <span class="n">b</span><span class="o">.</span><span class="n">a</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">b</span><span class="o">.</span><span class="n">class_attr</span> <span class="ow">is</span> <span class="n">Bar</span><span class="o">.</span><span class="n">class_attr</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12">8.12. Defining an Interface or Abstract Base Class</h3>
<div class="outline-text-3" id="text-1-12">
</div>
<div id="outline-container-sec-1-12-1" class="outline-4">
<h4 id="sec-1-12-1">create an abstract base class, or interface, by abc.ABCMeta, abc.abstractmethod</h4>
<div class="outline-text-4" id="text-1-12-1">
<p>
A abstract class can't be initialized.
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">abc</span> <span class="kn">import</span> <span class="n">ABCMeta</span><span class="p">,</span> <span class="n">abstractmethod</span>
<span class="k">class</span> <span class="nc">IStream</span><span class="p">(</span><span class="n">metaclass</span><span class="o">=</span><span class="n">ABCMeta</span><span class="p">):</span>
    <span class="nd">@abstractmethod</span>
    <span class="k">def</span> <span class="nf">read</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">maxbytes</span><span class="o">=-</span><span class="mi">1</span><span class="p">):</span>
	<span class="k">pass</span>
    <span class="nd">@abstractmethod</span>
    <span class="k">def</span> <span class="nf">write</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">data</span><span class="p">):</span>
	<span class="k">pass</span>

<span class="c1"># typical usage:</span>
<span class="k">def</span>  <span class="nf">foo</span><span class="p">(</span><span class="n">obj</span><span class="p">):</span>
    <span class="k">if</span> <span class="nb">isinstance</span><span class="p">(</span><span class="n">obj</span><span class="p">,</span> <span class="n">IStream</span><span class="p">):</span>
	<span class="c1"># processing an IStream here</span>
	<span class="k">pass</span>

<span class="n">a</span> <span class="o">=</span> <span class="n">IStream</span><span class="p">()</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-12-2" class="outline-4">
<h4 id="sec-1-12-2">register another class to a 'sub class ' of a abstract base class, by abc.register(cls) function</h4>
<div class="outline-text-4" id="text-1-12-2">
<p>
Then isinstance(obj, AbstractBaseClass) will be  True. This let another class which is not a subclass of a base class, but can still pass the isinstance() test, which means implementing a interface.
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">io</span>
<span class="c1"># Register the built-in I/O classes as supporting our interface</span>
<span class="n">IStream</span><span class="o">.</span><span class="n">register</span><span class="p">(</span><span class="n">io</span><span class="o">.</span><span class="n">IOBase</span><span class="p">)</span>
<span class="c1"># Open a normal file and type check</span>
<span class="n">f</span> <span class="o">=</span> <span class="nb">open</span><span class="p">(</span><span class="s1">'foo.txt'</span><span class="p">)</span>
<span class="nb">isinstance</span><span class="p">(</span><span class="n">f</span><span class="p">,</span> <span class="n">IStream</span><span class="p">)</span> <span class="c1"># Returns True</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13">8.13. Implementing a Data Model or Type System, by descriptor</h3>
<div class="outline-text-3" id="text-1-13">
<p>
感觉根之前小节讲到的descriptor相同，只不过用了继承的方式写了很多细小的descriptor。
</p>
</div>
</div>
<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14">what is a descriptor? and its usage</h3>
<div class="outline-text-3" id="text-1-14">
<p>
A descriptor is  a class attribute object, which has <span class="underline"><span class="underline">get</span></span>, <span class="underline"><span class="underline">set</span></span>, or <span class="underline"><span class="underline">delete</span></span> method, is used to define how a instance attribute is get, set, and delete. When an  instance attribute is get, the descriptor's <span class="underline"><span class="underline">get</span></span> method will be called. The same thing applys to <span class="underline"><span class="underline">set</span></span> and <span class="underline"><span class="underline">delete</span></span>
</p>

<p>
In descriptor's <span class="underline"><span class="underline">get</span></span>, <span class="underline"><span class="underline">set</span></span> methods, we must use instance._<sub>dict</sub>_<sub>[xxx]</sub> to get a attribute. If we use getattr(instance, xxx) to get that attribute, then there will be a recursion error as below, because the getattr() function will trigger a new call of <span class="underline"><span class="underline">get</span></span> method.
RecursionError: maximum recursion depth exceeded while calling a Python object
</p>

<p>
The relationship between the descriptor object and an instance attribute:
</p>
<ol class="org-ol">
<li>if the descriptor object is assigned to a class attribute with name 'attribute<sub>a'</sub>, then it will control the instance attribute with the same name.
</li>
<li>but there is  one exception: if only the <span class="underline"><span class="underline">get</span></span> method of a descriptor is defined, then the instance attribute with the same name will be not be controled by the  descriptor, it will be get directly from the <span class="underline"><span class="underline">dict</span></span>.
</li>
</ol>
<p>
a test:
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">TraceDescriptor</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">name</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">name</span> <span class="o">=</span> <span class="n">name</span>

    <span class="k">def</span> <span class="fm">__get__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">instance</span><span class="p">,</span> <span class="bp">cls</span><span class="p">):</span>
	<span class="k">if</span> <span class="n">instance</span><span class="p">:</span>
	    <span class="k">print</span><span class="p">(</span><span class="s1">'Getting attribute {}, value is {}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="p">,</span> <span class="n">instance</span><span class="o">.</span><span class="vm">__dict__</span><span class="p">[</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="p">]))</span>
	    <span class="k">return</span> <span class="n">instance</span><span class="o">.</span><span class="vm">__dict__</span><span class="p">[</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="p">]</span>
	    <span class="c1"># return getattr(instance, self.name)</span>
	<span class="k">else</span><span class="p">:</span>
	    <span class="k">return</span> <span class="n">instance</span>


    <span class="k">def</span> <span class="fm">__set__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">instance</span><span class="p">,</span> <span class="n">value</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s1">'Setting attribute {} to {}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="p">,</span> <span class="n">value</span><span class="p">))</span>
	<span class="n">instance</span><span class="o">.</span><span class="vm">__dict__</span><span class="p">[</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="p">]</span> <span class="o">=</span> <span class="n">value</span>

<span class="k">class</span> <span class="nc">Circle</span><span class="p">:</span>
    <span class="n">radius</span> <span class="o">=</span> <span class="n">TraceDescriptor</span><span class="p">(</span><span class="s1">'radius'</span><span class="p">)</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span>  <span class="n">radius</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">radius</span> <span class="o">=</span> <span class="n">radius</span>

<span class="n">c</span> <span class="o">=</span>  <span class="n">Circle</span><span class="p">(</span><span class="mi">4</span><span class="p">)</span>

<span class="k">print</span><span class="p">(</span><span class="n">c</span><span class="o">.</span><span class="n">radius</span><span class="p">)</span>
</pre></div>
</div>
</div>
