posts/python-cookbook-readnote-5/index.html

<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15">8.16. Defining More Than One Constructor in a Class, use a class method</h3>
<div class="outline-text-3" id="text-1-15">
<p>
GP: Always only assign values in the default  constructor(<span class="underline"><span class="underline">init</span></span>), and do other things by other constructors
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">time</span>

<span class="k">class</span> <span class="nc">Date</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">y</span><span class="p">,</span> <span class="n">m</span><span class="p">,</span>  <span class="n">d</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">year</span> <span class="o">=</span> <span class="n">y</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">month</span> <span class="o">=</span> <span class="n">m</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">day</span> <span class="o">=</span>  <span class="n">d</span>

    <span class="nd">@classmethod</span>
    <span class="k">def</span> <span class="nf">today</span><span class="p">(</span><span class="bp">cls</span><span class="p">):</span>
	<span class="n">t</span> <span class="o">=</span> <span class="n">time</span><span class="o">.</span><span class="n">localtime</span><span class="p">()</span>
	<span class="k">return</span> <span class="bp">cls</span><span class="p">(</span><span class="n">t</span><span class="o">.</span><span class="n">tm_year</span><span class="p">,</span> <span class="n">t</span><span class="o">.</span><span class="n">tm_mon</span><span class="p">,</span> <span class="n">t</span><span class="o">.</span><span class="n">tm_mday</span><span class="p">)</span>

    <span class="k">def</span> <span class="fm">__str__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">return</span> <span class="s1">'({0.year}, {0.month}, {0.day})'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="p">)</span>

<span class="n">d1</span> <span class="o">=</span> <span class="n">Date</span><span class="p">(</span><span class="mi">2017</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">d2</span> <span class="o">=</span> <span class="n">Date</span><span class="o">.</span><span class="n">today</span><span class="p">()</span>
<span class="k">print</span><span class="p">(</span><span class="n">d1</span><span class="p">,</span> <span class="n">d2</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16">8.17. Creating an Instance Without Invoking init</h3>
<div class="outline-text-3" id="text-1-16">
</div>
<div id="outline-container-sec-1-16-1" class="outline-4">
<h4 id="sec-1-16-1">the object._<sub>new</sub>_<sub>(*args, **kwargs)</sub> method: create a bare object</h4>
<div class="outline-text-4" id="text-1-16-1">
<p>
Every object has a <span class="underline"><span class="underline">new_<sub>method</sub>, which is inheritantanted from type._<sub>new</sub></span></span>.
</p>

<p>
The parameter should be a type object.
</p>

<p>
When you want to create an object from a json, this method can be used.
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">aspk_common</span> <span class="kn">as</span> <span class="nn">AC</span>
<span class="k">class</span> <span class="nc">Foo</span><span class="p">(</span><span class="n">AC</span><span class="o">.</span><span class="n">Structure</span><span class="p">):</span>
    <span class="n">_fields</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'x'</span><span class="p">]</span>

<span class="n">f</span> <span class="o">=</span> <span class="n">Foo</span><span class="p">(</span><span class="mi">2</span><span class="p">)</span>
<span class="n">g</span> <span class="o">=</span> <span class="n">Foo</span><span class="o">.</span><span class="fm">__new__</span><span class="p">(</span><span class="n">Foo</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="o">.</span><span class="vm">__dict__</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">g</span><span class="o">.</span><span class="vm">__dict__</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="nb">dir</span><span class="p">(</span><span class="n">f</span><span class="p">))</span>
<span class="k">print</span><span class="p">(</span><span class="nb">dir</span><span class="p">(</span><span class="n">g</span><span class="p">))</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-1-16-2" class="outline-4">
<h4 id="sec-1-16-2">Problem: how an object is constructed?</h4>
<div class="outline-text-4" id="text-1-16-2">
<p>
I guess first create a bare object by  calling the <span class="underline"><span class="underline">new</span></span> method, then call the object's <span class="underline"><span class="underline">init</span></span> method.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17">8.18. Extending Classes with Mixins</h3>
<div class="outline-text-3" id="text-1-17">
</div>
<div id="outline-container-sec-1-17-1" class="outline-4">
<h4 id="sec-1-17-1">mixin classes, used to extend function of a class, class customization, by multiple inheritance</h4>
<div class="outline-text-4" id="text-1-17-1">
<p>
SOLVED, see another comment. How below codes works? For 'super()._<sub>getitem</sub>_<sub>(key)</sub>', why dict._<sub>getitem</sub>__ method will be called?
</p>

<p>
After figuring out MRO, then I know how a mixin class works:
Mixin class is used to customize an existing class.
It make use of  MRO of multiple inheritance. Suppose 'Base' is the class to be customized, 'Mixin' is the mixin class, 'Foo' is the result  class, then the typical syntax is:
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Foo</span><span class="p">(</span><span class="n">Mixin</span><span class="p">,</span> <span class="n">Base</span><span class="p">):</span>
    <span class="k">pass</span>
</pre></div>
<p>
That is, put the mixin class as the first parent class, and the Base class as the second class. Then e.g. you want change a method of Base's behavier, such as 'foo', then you can just define a method named 'foo' in Mixin, and doing some work, then call 'super().foo(…)' to call Base's foo method.
</p>

<p>
Works like a decorator pattern.
</p>

<p>
But  what's difference between this method and by directly define the 'foo' method in Foo?
=&gt; maybe the main benifet is that  by putting the codes to a Mixin class, the codes can be easily reused.
</p>


<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">aspk_common</span> <span class="kn">as</span> <span class="nn">AC</span>
<span class="k">class</span> <span class="nc">Logging</span><span class="p">:</span>
    <span class="vm">__slots__</span> <span class="o">=</span> <span class="p">()</span>
    <span class="k">def</span> <span class="fm">__getitem__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">key</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s1">'Getting {}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">key</span><span class="p">))</span>
	<span class="k">print</span><span class="p">(</span><span class="s1">'self: {}</span><span class="se">\n</span><span class="s1">super: {}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="nb">super</span><span class="p">()))</span>
	<span class="k">return</span> <span class="nb">super</span><span class="p">()</span><span class="o">.</span><span class="fm">__getitem__</span><span class="p">(</span><span class="n">key</span><span class="p">)</span>

<span class="k">class</span> <span class="nc">LoggingDict</span><span class="p">(</span><span class="n">Logging</span><span class="p">,</span> <span class="nb">dict</span><span class="p">):</span>
    <span class="k">pass</span>

<span class="n">d</span> <span class="o">=</span> <span class="n">LoggingDict</span><span class="p">()</span>
<span class="n">d</span><span class="p">[</span><span class="s1">'x'</span><span class="p">]</span> <span class="o">=</span> <span class="mi">2</span>
<span class="k">print</span><span class="p">(</span><span class="n">d</span><span class="p">[</span><span class="s1">'x'</span><span class="p">])</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-1-18" class="outline-3">
<h3 id="sec-1-18">mutiple inheritance: how method/attribue are resolved if they exists in more than one  super classes</h3>
<div class="outline-text-3" id="text-1-18">
<p>
A method/attribute is resolved in the order of all parent class given.
e.g: 
class Foo(A, B)
if a method 'aaa' is defined in  both A and B, then A.aaa will be used.
</p>
</div>
</div>
