posts/python-cookbook-readnote-5/index.org
** python multiple inheritance, super and MRO(method resolution order)
   Guoid's words:
   http://python-history.blogspot.fi/2010/06/method-resolution-order.html
   depth first, from left to right, then delete all same classes expect the last one. Then diamond problem is solved.

   For below code snippets:
   From the printout, super() will return the next class in MRO(method resolve order) list, given a current class. The next class can be a real parent class for current class, or if the real parent class not exists,  then the next class will be the next parent class of the  current instance. For both two conditions, they are always the same class in MRO.

   For below codes: the MRO is [C, A, B].
   - So super() in class C's result is A
   - super() in  class A is B
   - super() in class B is object(I guess)
   #+begin_src python :results output
   class A:
       def foo(self):
           print("A")
           print(super())
           super().foo()
   class B:
       def foo(self):
           print("B")
           print(super())

   class C(A, B):
       def foo(self):
           print("C")
           print(super())
           super().foo()

   o = C()
   o.foo()
   print("MRO of C: ", C.__class__.__mro__)
   print("MRO() of C: ", C.__class__.mro(C))
   #+end_src

   #+RESULTS:
   : C
   : <super: <class 'C'>, <C object>>
   : A
   : <super: <class 'A'>, <C object>>
   : B
   : <super: <class 'B'>, <C object>>
   : MRO of C:  (<class 'type'>, <class 'object'>)
   : MRO() of C:  [<class '__main__.C'>, <class '__main__.A'>, <class '__main__.B'>, <class 'object'>]

** 8.19. Implementing Stateful Objects or State Machines
   Implementing the state pattern, by creating class for each state. In a class for one state, only define the method  use to handle the current state, all other methods should raise a 'NotImplementedError'.
   Will see this latter

** 8.20. Calling a Method on an Object Given the Name As a String, by getattr
   A method is just an attribute of an object, so first get the method by 'getattr' given string name
   #+begin_src python :results output
   class Foo:
       def foo(self):
           print("foo")

   f = Foo()
   getattr(f, 'foo')()
   #+end_src

   #+RESULTS:
   : foo

** 8.20. Calling a Method on an Object Given the Name As a String, by operator.methodcaller(name, *args)
   The benifit of methodcaller is that it will fix all parameters of the method. So if the method will be  called given same parameters for many differenntt object, this method might be better
   #+begin_src python :results output
   class Foo:
       def foo(self, x, y):
           print("foo: {}, {}".format(x, y))

   f = Foo()
   import operator
   operator.methodcaller('foo', 3, 4)(f)
   #+end_src

   #+RESULTS:
   : foo: 3, 4

