posts/python-cookbook-readnote-5/index.html

<div id="outline-container-sec-1-19" class="outline-3">
<h3 id="sec-1-19">python multiple inheritance, super and MRO(method resolution order)</h3>
<div class="outline-text-3" id="text-1-19">
<p>
Guoid's words:
<a href="http://python-history.blogspot.fi/2010/06/method-resolution-order.html">http://python-history.blogspot.fi/2010/06/method-resolution-order.html</a>
depth first, from left to right, then delete all same classes expect the last one. Then diamond problem is solved.
</p>

<p>
For below code snippets:
From the printout, super() will return the next class in MRO(method resolve order) list, given a current class. The next class can be a real parent class for current class, or if the real parent class not exists,  then the next class will be the next parent class of the  current instance. For both two conditions, they are always the same class in MRO.
</p>

<p>
For below codes: the MRO is [C, A, B].
</p>
<ul class="org-ul">
<li>So super() in class C's result is A
</li>
<li>super() in  class A is B
</li>
<li>super() in class B is object(I guess)
</li>
</ul>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">A</span><span class="p">:</span>
    <span class="k">def</span> <span class="nf">foo</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"A"</span><span class="p">)</span>
	<span class="k">print</span><span class="p">(</span><span class="nb">super</span><span class="p">())</span>
	<span class="nb">super</span><span class="p">()</span><span class="o">.</span><span class="n">foo</span><span class="p">()</span>
<span class="k">class</span> <span class="nc">B</span><span class="p">:</span>
    <span class="k">def</span> <span class="nf">foo</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"B"</span><span class="p">)</span>
	<span class="k">print</span><span class="p">(</span><span class="nb">super</span><span class="p">())</span>

<span class="k">class</span> <span class="nc">C</span><span class="p">(</span><span class="n">A</span><span class="p">,</span> <span class="n">B</span><span class="p">):</span>
    <span class="k">def</span> <span class="nf">foo</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"C"</span><span class="p">)</span>
	<span class="k">print</span><span class="p">(</span><span class="nb">super</span><span class="p">())</span>
	<span class="nb">super</span><span class="p">()</span><span class="o">.</span><span class="n">foo</span><span class="p">()</span>

<span class="n">o</span> <span class="o">=</span> <span class="n">C</span><span class="p">()</span>
<span class="n">o</span><span class="o">.</span><span class="n">foo</span><span class="p">()</span>
<span class="k">print</span><span class="p">(</span><span class="s2">"MRO of C: "</span><span class="p">,</span> <span class="n">C</span><span class="o">.</span><span class="vm">__class__</span><span class="o">.</span><span class="vm">__mro__</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="s2">"MRO() of C: "</span><span class="p">,</span> <span class="n">C</span><span class="o">.</span><span class="vm">__class__</span><span class="o">.</span><span class="n">mro</span><span class="p">(</span><span class="n">C</span><span class="p">))</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-20" class="outline-3">
<h3 id="sec-1-20">8.19. Implementing Stateful Objects or State Machines</h3>
<div class="outline-text-3" id="text-1-20">
<p>
Implementing the state pattern, by creating class for each state. In a class for one state, only define the method  use to handle the current state, all other methods should raise a 'NotImplementedError'.
Will see this latter
</p>
</div>
</div>

<div id="outline-container-sec-1-21" class="outline-3">
<h3 id="sec-1-21">8.20. Calling a Method on an Object Given the Name As a String, by getattr</h3>
<div class="outline-text-3" id="text-1-21">
<p>
A method is just an attribute of an object, so first get the method by 'getattr' given string name
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Foo</span><span class="p">:</span>
    <span class="k">def</span> <span class="nf">foo</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"foo"</span><span class="p">)</span>

<span class="n">f</span> <span class="o">=</span> <span class="n">Foo</span><span class="p">()</span>
<span class="nb">getattr</span><span class="p">(</span><span class="n">f</span><span class="p">,</span> <span class="s1">'foo'</span><span class="p">)()</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-22" class="outline-3">
<h3 id="sec-1-22">8.20. Calling a Method on an Object Given the Name As a String, by operator.methodcaller(name, *args)</h3>
<div class="outline-text-3" id="text-1-22">
<p>
The benifit of methodcaller is that it will fix all parameters of the method. So if the method will be  called given same parameters for many differenntt object, this method might be better
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Foo</span><span class="p">:</span>
    <span class="k">def</span> <span class="nf">foo</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">x</span><span class="p">,</span> <span class="n">y</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s2">"foo: {}, {}"</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">y</span><span class="p">))</span>

<span class="n">f</span> <span class="o">=</span> <span class="n">Foo</span><span class="p">()</span>
<span class="kn">import</span> <span class="nn">operator</span>
<span class="n">operator</span><span class="o">.</span><span class="n">methodcaller</span><span class="p">(</span><span class="s1">'foo'</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">4</span><span class="p">)(</span><span class="n">f</span><span class="p">)</span>
</pre></div>
</div>
</div>
