posts/python-cookbook-readnote-5/index.html

<div id="outline-container-sec-1-23" class="outline-3">
<h3 id="sec-1-23">8.21. Implementing the Visitor Pattern</h3>
<div class="outline-text-3" id="text-1-23">
<p>
感觉这里所说的vistor pattern主要是对用于处理包含不同类型对象的list. 用于通用处理。
基于类型系统的visitor pattern, 是通过在不同的基础类中的accept函数来实现 dispatch table的。相当于把dispatch table也耦合在基础类定义中了。
但最本质的目的是对于不同类型的对象，客户代码使用相同的代码进行处理。
</p>

<p>
将dispatch table 做在哪里，只影响一点点写法，对最终达到的效果没影响。
</p>


<p>
例子：
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Visitor</span><span class="p">:</span>
    <span class="k">def</span> <span class="nf">visit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="n">methname</span> <span class="o">=</span> <span class="s1">'visit_'</span> <span class="o">+</span> <span class="nb">type</span><span class="p">(</span><span class="n">node</span><span class="p">)</span><span class="o">.</span><span class="vm">__name__</span>
	<span class="n">meth</span> <span class="o">=</span> <span class="nb">getattr</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">methname</span><span class="p">,</span> <span class="bp">None</span><span class="p">)</span>
	<span class="k">if</span> <span class="n">meth</span> <span class="ow">is</span> <span class="bp">None</span><span class="p">:</span>
	    <span class="n">meth</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">generic_visit</span>
	<span class="k">return</span> <span class="n">meth</span><span class="p">(</span><span class="n">node</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">generic_visit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="k">raise</span> <span class="ne">RuntimeError</span><span class="p">(</span><span class="s1">'No {} method'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="s1">'visit_'</span> <span class="o">+</span> <span class="nb">type</span><span class="p">(</span><span class="n">node</span><span class="p">)</span><span class="o">.</span><span class="vm">__name__</span><span class="p">))</span>

<span class="k">class</span> <span class="nc">File</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">name</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">name</span> <span class="o">=</span> <span class="n">name</span>

<span class="k">class</span> <span class="nc">RegularFile</span><span class="p">(</span><span class="n">File</span><span class="p">):</span>
    <span class="k">def</span> <span class="nf">read_content</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">return</span> <span class="s2">"This is the content for file {}"</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="p">)</span>

<span class="k">class</span> <span class="nc">Directory</span><span class="p">(</span><span class="n">File</span><span class="p">):</span>
    <span class="k">def</span> <span class="nf">children</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="sd">'''Return all children names as a list'''</span>
	<span class="k">return</span> <span class="p">[</span><span class="n">RegularFile</span><span class="p">(</span><span class="s1">'a.txt'</span><span class="p">),</span> <span class="n">RegularFile</span><span class="p">(</span><span class="s1">'b.exe'</span><span class="p">)]</span>

<span class="k">class</span> <span class="nc">Symbolic</span><span class="p">(</span><span class="n">File</span><span class="p">):</span>
    <span class="k">def</span> <span class="nf">real</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="sd">'''Return real file this symbolic point to'''</span>
	<span class="k">return</span> <span class="n">RegularFile</span><span class="p">(</span><span class="s1">'dd.txt'</span><span class="p">)</span>

<span class="k">class</span> <span class="nc">CatVisitor</span><span class="p">(</span><span class="n">Visitor</span><span class="p">):</span>
    <span class="sd">'''Implement cat command for a File object.'''</span>
    <span class="k">def</span>  <span class="nf">visit_RegularFile</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s1">'content for regular file {}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">node</span><span class="o">.</span><span class="n">name</span><span class="p">))</span>
	<span class="k">print</span><span class="p">(</span><span class="n">node</span><span class="o">.</span><span class="n">read_content</span><span class="p">())</span>
    <span class="k">def</span> <span class="nf">visit_Directory</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s1">'content for directory {}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">node</span><span class="o">.</span><span class="n">name</span><span class="p">))</span>
	<span class="k">for</span> <span class="n">f</span> <span class="ow">in</span> <span class="n">node</span><span class="o">.</span><span class="n">children</span><span class="p">():</span>
	    <span class="bp">self</span><span class="o">.</span><span class="n">visit</span><span class="p">(</span><span class="n">f</span><span class="p">)</span>
    <span class="k">def</span> <span class="nf">visit_Symbolic</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="k">print</span><span class="p">(</span><span class="s1">'content for symbolic file {}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">node</span><span class="o">.</span><span class="n">name</span><span class="p">))</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">visit</span><span class="p">(</span><span class="n">node</span><span class="o">.</span><span class="n">real</span><span class="p">())</span>

<span class="n">files</span> <span class="o">=</span> <span class="p">[</span><span class="n">RegularFile</span><span class="p">(</span><span class="s1">'foo.txt'</span><span class="p">),</span> <span class="n">Directory</span><span class="p">(</span><span class="s1">'bar'</span><span class="p">),</span> <span class="n">RegularFile</span><span class="p">(</span><span class="s1">'a.txt'</span><span class="p">),</span> <span class="n">Symbolic</span><span class="p">(</span><span class="s1">'aa.c'</span><span class="p">)]</span>
<span class="n">visitor</span> <span class="o">=</span> <span class="n">CatVisitor</span><span class="p">()</span>
<span class="k">for</span> <span class="nb">file</span> <span class="ow">in</span> <span class="n">files</span><span class="p">:</span>
    <span class="n">visitor</span><span class="o">.</span><span class="n">visit</span><span class="p">(</span><span class="nb">file</span><span class="p">)</span>
    <span class="k">print</span><span class="p">()</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-24" class="outline-3">
<h3 id="sec-1-24">dispatch table in python, decided by object type</h3>
<div class="outline-text-3" id="text-1-24">
<p>
将所有处理函数写在一个类中， 提供一个根据待处理对象类型分发的函数。 这个作为dispatch 基类。然后再定义针对每种类型的visit函数就行了。
这里类有两个目的：
</p>
<ol class="org-ol">
<li>定义dispatch table
</li>
<li>对一组函数的名字空间吧。
</li>
<li>以下例子中实现的 Dispatcher class 是通用的，可以共用。
</li>
</ol>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Dispatcher</span><span class="p">:</span>
    <span class="k">def</span> <span class="nf">visit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="n">methname</span> <span class="o">=</span> <span class="s1">'visit_'</span> <span class="o">+</span> <span class="nb">type</span><span class="p">(</span><span class="n">node</span><span class="p">)</span><span class="o">.</span><span class="vm">__name__</span>
	<span class="n">meth</span> <span class="o">=</span> <span class="nb">getattr</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">methname</span><span class="p">,</span> <span class="bp">None</span><span class="p">)</span>
	<span class="k">if</span> <span class="n">meth</span> <span class="ow">is</span> <span class="bp">None</span><span class="p">:</span>
	    <span class="n">meth</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">generic_visit</span>
	<span class="k">return</span> <span class="n">meth</span><span class="p">(</span><span class="n">node</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">generic_visit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="k">raise</span> <span class="ne">RuntimeError</span><span class="p">(</span><span class="s1">'No {} method'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="s1">'visit_'</span> <span class="o">+</span> <span class="nb">type</span><span class="p">(</span><span class="n">node</span><span class="p">)</span><span class="o">.</span><span class="vm">__name__</span><span class="p">))</span>

<span class="k">class</span> <span class="nc">FooDispatcher</span><span class="p">(</span><span class="n">Dispatcher</span><span class="p">):</span>
    <span class="k">def</span> <span class="nf">visit_RegularFile</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="k">pass</span>
    <span class="k">def</span> <span class="nf">visit_Directory</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">node</span><span class="p">):</span>
	<span class="k">pass</span>
</pre></div>
</div>
</div>
