posts/python-cookbook-readnote-5/index.org
** 8.23. Managing Memory in Cyclic Data Structures, by weakref.ref(aobject)
   When cyclic reference exists, the some  object will never be deleted, because its reference coutns is  large than 0.
   A weakref is just a reference that don't increase the reference count. To dereference, just call it like a function. If the referenced object still exists, the object will be returne, otherwise None will be returned.

   For a tree structure, the book give an example of reference the parent node by  weakref.

   Note: you can't weakref to 'int', 'str', ...
   #+begin_src python :results output
   import weakref
   class Node:
       pass
   a = Node()
   b = weakref.ref(a)
   # c = a     # if this line exists, then a will not be deleted after 'del a', then the second call to b() will still return a

   print(b())
   del a
   print(b())
   #+end_src

   #+RESULTS:
   : <__main__.Node object at 0x0000004C8D3DC940>
   : None

** 8.24. Making Classes Support Comparison Operations, by define many comparision builtin method: __eq__, __lt__, __le__, __gt__, __ge__, __ne__
** 8.25. Creating Cached Instances, by  create a factory method(a class method)
   If the parameter are the same, then return an existing object.
